Revit 2027 API
RoutingPreferenceRule Constructor
 Constructs a RoutingPreferenceRule containing a segment or fitting Id (MEPPartId) and description.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoutingPreferenceRule(
	ElementId MEPPartId,
	string description
)
Public Sub New (
	MEPPartId As ElementId,
	description As String
)
public:
RoutingPreferenceRule(
	ElementId^ MEPPartId,
	String^ description
)
new :
        MEPPartId : ElementId *
        description : string -> RoutingPreferenceRule
Parameters
MEPPartId ElementId
 The Id of the segment or fitting. InvalidElementId may be specified if no MEPPart will be allowed when the conditions satisfy the criteria in this rule.
description String
 The description of the rule.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace